---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Railing.IsDefault
zh: 栏杆
source: html/03ee5975-6d93-f6d1-0c6f-ab31c0331f34.htm
---
# Autodesk.Revit.DB.Architecture.Railing.IsDefault Property

**中文**: 栏杆

Indicates if the railing is the default one that system generates.

## Syntax (C#)
```csharp
public bool IsDefault { get; }
```